FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sdh_reg.h
     * |[23:0]  |TOUT      |SD Response/Data-in Time-out Value
     * |        |          |A 24-bit value specifies the time-out counts of response and data input
     * |        |          |SD host controller will wait start bit of response or data-in until this value reached
     * |        |          |The time period depends on SD engine clock frequency
     * |        |          |Do not write a small number into this field, or you may never get response or data due to time-out.
     * |        |          |Note: Filling 0x0 into this field will disable hardware time-out function.
     */

    __IO uint32_t FB[ 32 ];  /*!< Shared Buffer (FIFO)                                                      */
    __I uint32_t RESERVE0[ 224 ];
    __IO uint32_t DMACTL;    /*!< [0x0400] DMA Control and Status Register                                  */
    __I uint32_t RESERVE1[ 1 ];
    __IO uint32_t DMASA;     /*!< [0x0408] DMA Transfer Starting Address Register                           */
    __I uint32_t DMABCNT;    /*!< [0x040c] DMA Transfer Byte Count Register                                 */
    __IO uint32_t DMAINTEN;  /*!< [0x0410] DMA Interrupt Enable Control Register                            */
    __IO uint32_t DMAINTSTS; /*!< [0x0414] DMA Interrupt Status Register                                    */
    __I uint32_t RESERVE2[ 250 ];
    __IO uint32_t GCTL;      /*!< [0x0800] Global Control and Status Register                               */
    __IO uint32_t GINTEN;    /*!< [0x0804] Global Interrupt Control Register                                */
    __IO uint32_t GINTSTS;   /*!< [0x0808] Global Interrupt Status Register                                 */
    __I uint32_t RESERVE3[ 5 ];
    __IO uint32_t CTL;       /*!< [0x0820] SD Control and Status Register                                   */
    __IO uint32_t CMDARG;    /*!< [0x0824] SD Command Argument Register                                     */
    __IO uint32_t INTEN;     /*!< [0x0828] SD Interrupt Control Register                                    */
    __IO uint32_t INTSTS;    /*!< [0x082c] SD Interrupt Status Register                                     */
    __I uint32_t RESP0;      /*!< [0x0830] SD Receiving Response Token Register 0                           */
    __I uint32_t RESP1;      /*!< [0x0834] SD Receiving Response Token Register 1                           */
    __IO uint32_t BLEN;      /*!< [0x0838] SD Block Length Register                                         */
    __IO uint32_t TOUT;      /*!< [0x083c] SD Response/Data-in Time-out Register                            */
} SDH_T;

/**
 *  @addtogroup SDH_CONST SDH Bit Field Definition
 *  Constant Definitions for SDH Controller
 * @{ */

#define SDH_DMACTL_DMAEN_Pos         ( 0 )                                                 /*!< SDH_T::DMACTL: DMAEN Position          */
#define SDH_DMACTL_DMAEN_Msk         ( 0x1ul << SDH_DMACTL_DMAEN_Pos )                     /*!< SDH_T::DMACTL: DMAEN Mask              */

#define SDH_DMACTL_DMARST_Pos        ( 1 )                                                 /*!< SDH_T::DMACTL: DMARST Position         */
#define SDH_DMACTL_DMARST_Msk        ( 0x1ul << SDH_DMACTL_DMARST_Pos )                    /*!< SDH_T::DMACTL: DMARST Mask             */

#define SDH_DMACTL_SGEN_Pos          ( 3 )                                                 /*!< SDH_T::DMACTL: SGEN Position           */
#define SDH_DMACTL_SGEN_Msk          ( 0x1ul << SDH_DMACTL_SGEN_Pos )                      /*!< SDH_T::DMACTL: SGEN Mask               */

#define SDH_DMACTL_DMABUSY_Pos       ( 9 )                                                 /*!< SDH_T::DMACTL: DMABUSY Position        */
#define SDH_DMACTL_DMABUSY_Msk       ( 0x1ul << SDH_DMACTL_DMABUSY_Pos )                   /*!< SDH_T::DMACTL: DMABUSY Mask            */

#define SDH_DMASA_ORDER_Pos          ( 0 )                                                 /*!< SDH_T::DMASA: ORDER Position           */
#define SDH_DMASA_ORDER_Msk          ( 0x1ul << SDH_DMASA_ORDER_Pos )                      /*!< SDH_T::DMASA: ORDER Mask               */

#define SDH_DMASA_DMASA_Pos          ( 1 )                                                 /*!< SDH_T::DMASA: DMASA Position           */
#define SDH_DMASA_DMASA_Msk          ( 0x7ffffffful << SDH_DMASA_DMASA_Pos )               /*!< SDH_T::DMASA: DMASA Mask               */

#define SDH_DMABCNT_BCNT_Pos         ( 0 )                                                 /*!< SDH_T::DMABCNT: BCNT Position          */
#define SDH_DMABCNT_BCNT_Msk         ( 0x3fffffful << SDH_DMABCNT_BCNT_Pos )               /*!< SDH_T::DMABCNT: BCNT Mask              */

#define SDH_DMAINTEN_ABORTIEN_Pos    ( 0 )                                                 /*!< SDH_T::DMAINTEN: ABORTIEN Position     */
#define SDH_DMAINTEN_ABORTIEN_Msk    ( 0x1ul << SDH_DMAINTEN_ABORTIEN_Pos )                /*!< SDH_T::DMAINTEN: ABORTIEN Mask         */

#define SDH_DMAINTEN_WEOTIEN_Pos     ( 1 )                                                 /*!< SDH_T::DMAINTEN: WEOTIEN Position      */
#define SDH_DMAINTEN_WEOTIEN_Msk     ( 0x1ul << SDH_DMAINTEN_WEOTIEN_Pos )                 /*!< SDH_T::DMAINTEN: WEOTIEN Mask          */

#define SDH_DMAINTSTS_ABORTIF_Pos    ( 0 )                                                 /*!< SDH_T::DMAINTSTS: ABORTIF Position     */
#define SDH_DMAINTSTS_ABORTIF_Msk    ( 0x1ul << SDH_DMAINTSTS_ABORTIF_Pos )                /*!< SDH_T::DMAINTSTS: ABORTIF Mask         */

#define SDH_DMAINTSTS_WEOTIF_Pos     ( 1 )                                                 /*!< SDH_T::DMAINTSTS: WEOTIF Position      */
#define SDH_DMAINTSTS_WEOTIF_Msk     ( 0x1ul << SDH_DMAINTSTS_WEOTIF_Pos )                 /*!< SDH_T::DMAINTSTS: WEOTIF Mask          */

#define SDH_GCTL_GCTLRST_Pos         ( 0 )                                                 /*!< SDH_T::GCTL: GCTLRST Position          */
#define SDH_GCTL_GCTLRST_Msk         ( 0x1ul << SDH_GCTL_GCTLRST_Pos )                     /*!< SDH_T::GCTL: GCTLRST Mask              */

#define SDH_GCTL_SDEN_Pos            ( 1 )                                                 /*!< SDH_T::GCTL: SDEN Position             */
#define SDH_GCTL_SDEN_Msk            ( 0x1ul << SDH_GCTL_SDEN_Pos )                        /*!< SDH_T::GCTL: SDEN Mask                 */

#define SDH_GINTEN_DTAIEN_Pos        ( 0 )                                                 /*!< SDH_T::GINTEN: DTAIEN Position         */
#define SDH_GINTEN_DTAIEN_Msk        ( 0x1ul << SDH_GINTEN_DTAIEN_Pos )                    /*!< SDH_T::GINTEN: DTAIEN Mask             */

#define SDH_GINTSTS_DTAIF_Pos        ( 0 )                                                 /*!< SDH_T::GINTSTS: DTAIF Position         */
#define SDH_GINTSTS_DTAIF_Msk        ( 0x1ul << SDH_GINTSTS_DTAIF_Pos )                    /*!< SDH_T::GINTSTS: DTAIF Mask             */

#define SDH_CTL_COEN_Pos             ( 0 )                                                 /*!< SDH_T::CTL: COEN Position              */
#define SDH_CTL_COEN_Msk             ( 0x1ul << SDH_CTL_COEN_Pos )                         /*!< SDH_T::CTL: COEN Mask                  */

#define SDH_CTL_RIEN_Pos             ( 1 )                                                 /*!< SDH_T::CTL: RIEN Position              */
#define SDH_CTL_RIEN_Msk             ( 0x1ul << SDH_CTL_RIEN_Pos )                         /*!< SDH_T::CTL: RIEN Mask                  */

#define SDH_CTL_DIEN_Pos             ( 2 )                                                 /*!< SDH_T::CTL: DIEN Position              */
#define SDH_CTL_DIEN_Msk             ( 0x1ul << SDH_CTL_DIEN_Pos )                         /*!< SDH_T::CTL: DIEN Mask                  */

#define SDH_CTL_DOEN_Pos             ( 3 )                                                 /*!< SDH_T::CTL: DOEN Position              */
#define SDH_CTL_DOEN_Msk             ( 0x1ul << SDH_CTL_DOEN_Pos )                         /*!< SDH_T::CTL: DOEN Mask                  */

#define SDH_CTL_R2EN_Pos             ( 4 )                                                 /*!< SDH_T::CTL: R2EN Position              */
#define SDH_CTL_R2EN_Msk             ( 0x1ul << SDH_CTL_R2EN_Pos )                         /*!< SDH_T::CTL: R2EN Mask                  */

