FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sdh_reg.h
#define SDH_CTL_CLK74OEN_Pos         ( 5 )                                                 /*!< SDH_T::CTL: CLK74OEN Position          */
#define SDH_CTL_CLK74OEN_Msk         ( 0x1ul << SDH_CTL_CLK74OEN_Pos )                     /*!< SDH_T::CTL: CLK74OEN Mask              */

#define SDH_CTL_CLK8OEN_Pos          ( 6 )                                                 /*!< SDH_T::CTL: CLK8OEN Position           */
#define SDH_CTL_CLK8OEN_Msk          ( 0x1ul << SDH_CTL_CLK8OEN_Pos )                      /*!< SDH_T::CTL: CLK8OEN Mask               */

#define SDH_CTL_CLKKEEP_Pos          ( 7 )                                                 /*!< SDH_T::CTL: CLKKEEP Position          */
#define SDH_CTL_CLKKEEP_Msk          ( 0x1ul << SDH_CTL_CLKKEEP_Pos )                      /*!< SDH_T::CTL: CLKKEEP Mask              */

#define SDH_CTL_CMDCODE_Pos          ( 8 )                                                 /*!< SDH_T::CTL: CMDCODE Position           */
#define SDH_CTL_CMDCODE_Msk          ( 0x3ful << SDH_CTL_CMDCODE_Pos )                     /*!< SDH_T::CTL: CMDCODE Mask               */

#define SDH_CTL_CTLRST_Pos           ( 14 )                                                /*!< SDH_T::CTL: CTLRST Position            */
#define SDH_CTL_CTLRST_Msk           ( 0x1ul << SDH_CTL_CTLRST_Pos )                       /*!< SDH_T::CTL: CTLRST Mask                */

#define SDH_CTL_DBW_Pos              ( 15 )                                                /*!< SDH_T::CTL: DBW Position               */
#define SDH_CTL_DBW_Msk              ( 0x1ul << SDH_CTL_DBW_Pos )                          /*!< SDH_T::CTL: DBW Mask                   */

#define SDH_CTL_BLKCNT_Pos           ( 16 )                                                /*!< SDH_T::CTL: BLKCNT Position            */
#define SDH_CTL_BLKCNT_Msk           ( 0xfful << SDH_CTL_BLKCNT_Pos )                      /*!< SDH_T::CTL: BLKCNT Mask                */

#define SDH_CTL_SDNWR_Pos            ( 24 )                                                /*!< SDH_T::CTL: SDNWR Position             */
#define SDH_CTL_SDNWR_Msk            ( 0xful << SDH_CTL_SDNWR_Pos )                        /*!< SDH_T::CTL: SDNWR Mask                 */

#define SDH_CMDARG_ARGUMENT_Pos      ( 0 )                                                 /*!< SDH_T::CMDARG: ARGUMENT Position       */
#define SDH_CMDARG_ARGUMENT_Msk      ( 0xfffffffful << SDH_CMDARG_ARGUMENT_Pos )           /*!< SDH_T::CMDARG: ARGUMENT Mask           */

#define SDH_INTEN_BLKDIEN_Pos        ( 0 )                                                 /*!< SDH_T::INTEN: BLKDIEN Position         */
#define SDH_INTEN_BLKDIEN_Msk        ( 0x1ul << SDH_INTEN_BLKDIEN_Pos )                    /*!< SDH_T::INTEN: BLKDIEN Mask             */

#define SDH_INTEN_CRCIEN_Pos         ( 1 )                                                 /*!< SDH_T::INTEN: CRCIEN Position          */
#define SDH_INTEN_CRCIEN_Msk         ( 0x1ul << SDH_INTEN_CRCIEN_Pos )                     /*!< SDH_T::INTEN: CRCIEN Mask              */

#define SDH_INTEN_CDIEN_Pos          ( 8 )                                                 /*!< SDH_T::INTEN: CDIEN Position          */
#define SDH_INTEN_CDIEN_Msk          ( 0x1ul << SDH_INTEN_CDIEN_Pos )                      /*!< SDH_T::INTEN: CDIEN Mask              */

#define SDH_INTEN_RTOIEN_Pos         ( 12 )                                                /*!< SDH_T::INTEN: RTOIEN Position          */
#define SDH_INTEN_RTOIEN_Msk         ( 0x1ul << SDH_INTEN_RTOIEN_Pos )                     /*!< SDH_T::INTEN: RTOIEN Mask              */

#define SDH_INTEN_DITOIEN_Pos        ( 13 )                                                /*!< SDH_T::INTEN: DITOIEN Position         */
#define SDH_INTEN_DITOIEN_Msk        ( 0x1ul << SDH_INTEN_DITOIEN_Pos )                    /*!< SDH_T::INTEN: DITOIEN Mask             */

#define SDH_INTEN_WKIEN_Pos          ( 14 )                                                /*!< SDH_T::INTEN: WKIEN Position           */
#define SDH_INTEN_WKIEN_Msk          ( 0x1ul << SDH_INTEN_WKIEN_Pos )                      /*!< SDH_T::INTEN: WKIEN Mask               */

#define SDH_INTEN_CDSRC_Pos          ( 30 )                                                /*!< SDH_T::INTEN: CDSRC Position          */
#define SDH_INTEN_CDSRC_Msk          ( 0x1ul << SDH_INTEN_CDSRC_Pos )                      /*!< SDH_T::INTEN: CDSRC Mask              */

#define SDH_INTSTS_BLKDIF_Pos        ( 0 )                                                 /*!< SDH_T::INTSTS: BLKDIF Position         */
#define SDH_INTSTS_BLKDIF_Msk        ( 0x1ul << SDH_INTSTS_BLKDIF_Pos )                    /*!< SDH_T::INTSTS: BLKDIF Mask             */

#define SDH_INTSTS_CRCIF_Pos         ( 1 )                                                 /*!< SDH_T::INTSTS: CRCIF Position          */
#define SDH_INTSTS_CRCIF_Msk         ( 0x1ul << SDH_INTSTS_CRCIF_Pos )                     /*!< SDH_T::INTSTS: CRCIF Mask              */

#define SDH_INTSTS_CRC7_Pos          ( 2 )                                                 /*!< SDH_T::INTSTS: CRC7 Position           */
#define SDH_INTSTS_CRC7_Msk          ( 0x1ul << SDH_INTSTS_CRC7_Pos )                      /*!< SDH_T::INTSTS: CRC7 Mask               */

#define SDH_INTSTS_CRC16_Pos         ( 3 )                                                 /*!< SDH_T::INTSTS: CRC16 Position          */
#define SDH_INTSTS_CRC16_Msk         ( 0x1ul << SDH_INTSTS_CRC16_Pos )                     /*!< SDH_T::INTSTS: CRC16 Mask              */

#define SDH_INTSTS_CRCSTS_Pos        ( 4 )                                                 /*!< SDH_T::INTSTS: CRCSTS Position         */
#define SDH_INTSTS_CRCSTS_Msk        ( 0x7ul << SDH_INTSTS_CRCSTS_Pos )                    /*!< SDH_T::INTSTS: CRCSTS Mask             */

#define SDH_INTSTS_DAT0STS_Pos       ( 7 )                                                 /*!< SDH_T::INTSTS: DAT0STS Position        */
#define SDH_INTSTS_DAT0STS_Msk       ( 0x1ul << SDH_INTSTS_DAT0STS_Pos )                   /*!< SDH_T::INTSTS: DAT0STS Mask            */

#define SDH_INTSTS_CDIF_Pos          ( 8 )                                                 /*!< SDH_T::INTSTS: CDIF Position          */
#define SDH_INTSTS_CDIF_Msk          ( 0x1ul << SDH_INTSTS_CDIF_Pos )                      /*!< SDH_T::INTSTS: CDIF Mask              */

