FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/sdh_reg.h
#define SDH_INTSTS_RTOIF_Pos         ( 12 )                                                /*!< SDH_T::INTSTS: RTOIF Position          */
#define SDH_INTSTS_RTOIF_Msk         ( 0x1ul << SDH_INTSTS_RTOIF_Pos )                     /*!< SDH_T::INTSTS: RTOIF Mask              */

#define SDH_INTSTS_DITOIF_Pos        ( 13 )                                                /*!< SDH_T::INTSTS: DITOIF Position         */
#define SDH_INTSTS_DITOIF_Msk        ( 0x1ul << SDH_INTSTS_DITOIF_Pos )                    /*!< SDH_T::INTSTS: DITOIF Mask             */

#define SDH_INTSTS_CDSTS_Pos         ( 16 )                                                /*!< SDH_T::INTSTS: CDSTS Position         */
#define SDH_INTSTS_CDSTS_Msk         ( 0x1ul << SDH_INTSTS_CDSTS_Pos )                     /*!< SDH_T::INTSTS: CDSTS Mask             */

#define SDH_INTSTS_DAT1STS_Pos       ( 18 )                                                /*!< SDH_T::INTSTS: DAT1STS Position        */
#define SDH_INTSTS_DAT1STS_Msk       ( 0x1ul << SDH_INTSTS_DAT1STS_Pos )                   /*!< SDH_T::INTSTS: DAT1STS Mask            */

#define SDH_RESP0_RESPTK0_Pos        ( 0 )                                                 /*!< SDH_T::RESP0: RESPTK0 Position         */
#define SDH_RESP0_RESPTK0_Msk        ( 0xfffffffful << SDH_RESP0_RESPTK0_Pos )             /*!< SDH_T::RESP0: RESPTK0 Mask             */

#define SDH_RESP1_RESPTK1_Pos        ( 0 )                                                 /*!< SDH_T::RESP1: RESPTK1 Position         */
#define SDH_RESP1_RESPTK1_Msk        ( 0xfful << SDH_RESP1_RESPTK1_Pos )                   /*!< SDH_T::RESP1: RESPTK1 Mask             */

#define SDH_BLEN_BLKLEN_Pos          ( 0 )                                                 /*!< SDH_T::BLEN: BLKLEN Position           */
#define SDH_BLEN_BLKLEN_Msk          ( 0x7fful << SDH_BLEN_BLKLEN_Pos )                    /*!< SDH_T::BLEN: BLKLEN Mask               */

#define SDH_TOUT_TOUT_Pos            ( 0 )                                                 /*!< SDH_T::TOUT: TOUT Position             */
#define SDH_TOUT_TOUT_Msk            ( 0xfffffful << SDH_TOUT_TOUT_Pos )                   /*!< SDH_T::TOUT: TOUT Mask                 */

/**@}*/ /* SDH_CONST */
/**@}*/ /* end of SDH register group */
/**@}*/ /* end of REGISTER group */


#endif /* __SDH_REG_H__ */
